Model: "double_tower_single_backbone"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
left_input (InputLayer)         [(None, 380, 380, 3) 0
__________________________________________________________________________________________________
right_input (InputLayer)        [(None, 380, 380, 3) 0
__________________________________________________________________________________________________
model (Functional)              (None, 3584)         17673823    left_input[0][0]
                                                                 right_input[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 7168)         0           model[0][0]
                                                                 model[1][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 7168)         0           concatenate_1[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         7341056     flatten[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dense[0][0]
__________________________________________________________________________________________________
class_head (Functional)         (None, 2)            2048        dense_1[0][0]
__________________________________________________________________________________________________
predictions (Activation)        (None, 2)            0           class_head[0][0]
==================================================================================================
Total params: 26,066,527
Trainable params: 25,941,320
Non-trainable params: 125,207
__________________________________________________________________________________________________
None

Model: "double_tower_double_backbone"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, None, None,  0
__________________________________________________________________________________________________
2678_efficientnetb4 (Functional (None, None, None, 1 17673823    input_1[0][0]
__________________________________________________________________________________________________
8795_efficientnetb4 (Functional (None, None, None, 1 17673823    input_3[0][0]
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 1792)         0           2678_efficientnetb4[0][0]
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 1792)         0           2678_efficientnetb4[0][0]
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 1792)         0           8795_efficientnetb4[0][0]
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 1792)         0           8795_efficientnetb4[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3584)         0           global_average_pooling2d[0][0]
                                                                 global_max_pooling2d[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 3584)         0           global_average_pooling2d_1[0][0]
                                                                 global_max_pooling2d_1[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 7168)         0           concatenate[0][0]
                                                                 concatenate_1[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 7168)         0           concatenate_2[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         7341056     flatten[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dense[0][0]
__________________________________________________________________________________________________
class_head (Functional)         (None, 2)            2048        dense_1[0][0]
__________________________________________________________________________________________________
predictions (Activation)        (None, 2)            0           class_head[0][0]
==================================================================================================
Total params: 43,740,350
Trainable params: 43,489,936
Non-trainable params: 250,414
__________________________________________________________________________________________________
None
