Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, None, None,  0
__________________________________________________________________________________________________
6316_efficientnetb5 (Functional (None, None, None, 2 28513527    input_1[0][0]
__________________________________________________________________________________________________
370_efficientnetb5 (Functional) (None, None, None, 2 28513527    input_3[0][0]
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 2048)         0           6316_efficientnetb5[0][0]
__________________________________________________________________________________________________
global_max_pooling2d (GlobalMax (None, 2048)         0           6316_efficientnetb5[0][0]
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           370_efficientnetb5[0][0]
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           370_efficientnetb5[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 4096)         0           global_average_pooling2d[0][0]
                                                                 global_max_pooling2d[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_average_pooling2d_1[0][0]
                                                                 global_max_pooling2d_1[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 8192)         0           concatenate[0][0]
                                                                 concatenate_1[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 8192)         0           concatenate_2[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         8389632     flatten[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dense[0][0]
__________________________________________________________________________________________________
class_head (Functional)         (None, 2)            2048        dense_1[0][0]
__________________________________________________________________________________________________
predictions (Activation)        (None, 2)            0           class_head[0][0]
==================================================================================================
Total params: 66,468,334
Trainable params: 66,122,848
Non-trainable params: 345,486
__________________________________________________________________________________________________
None